Repository: Bounga/renamer
Catalog: po/*/renamer.po
Languages: fr

source: Usage: %s [options] FILENAMES
fr: Utilisation : %s [options] FICHIERS

source: Specific options:
fr: Options spécifiques :

source: Downcase FILENAMES
fr: Mettre FICHIERS en minuscules

source: Upcase FILENAMES
fr: Mettre FICHIERS en majuscules

source: Capitalize FILENAMES
fr: Capitalise FICHIERS

source: Capitalize each words in FILENAMES
fr: Capitalise chaque mot dans FICHIERS

source: Downcase FILENAMES extensions
fr: Mettre l'extension de FICHIERS en minuscules

source: Upcase FILENAMES extensions
fr: Mettre l'extension de FICHIERS en majuscules

source: Replace spaces by underscores in FILENAMES
fr: Transforme les espaces dans FICHIERS par des blancs soulignés

source: Replace underscores by spaces in FILENAMES
fr: Remplace les blancs soulignés par des espaces dans FICHIERS

source: Add current date to the beginning of FILENAMES
fr: Ajouter la date courante en début de FICHIERS

source: Add current datetime to the beginning of FILENAMES
fr: Ajouter la date et l'heure courante en début de FICHIERS

source: --basename BASENAME
fr: --basename NOM_DE_BASE

source: Rename FILENAMES using the specified
fr: Renomme FICHIERS. en utilisant le

source: BASENAME followed by an incremental number
fr: NOM_DE_BASE spécifié suivit d'un nombre incrémental

source: --ext NEW
fr: --ext NOUVELLE

source: Rename FILENAMES from their actual extension
fr: Renomme FICHIERS de leur extension actuelle

source: to the NEW one
fr: à la NOUVELLE

source: Rename FILENAMES by trimming first n characters
fr: Renomme FICHIERS en enlevant les n premiers caractères

source: Rename FILENAMES by trimming last n characters
fr: Renomme FICHIERS en enlevant les n derniers caractères

source: Run %s recursively across directories
fr: Éxécute %s récurisivement à travers les répertoires

source: Overwrite existing files if needed
fr: Écrase les fichiers existants si nécessaire

source: Common options:
fr: Options habituelles

source: Show this help
fr: Affiche cette aide

source: Show %s version
fr: Affiche la version de %s

source: Show some information about %s license
fr: Affiche quelques informations à propos de la licence de %s

source: Run %s in verbose mode (quiet by default)
fr: Éxécute %s en mode verbeux (silencieux par défaut)

source: %s: %s file already exists!
fr: %s : Le fichier %s existe déjà !

source: %s: You don't have write access on %s
fr: %s : Vous n'avez pas les droits en écriture sur %s

source: %s: File %s doesn't exists!
fr: %s : Le fichier %s n'existe pas !
